---
kind: property
id: P:Autodesk.Revit.DB.FaceArray.IsEmpty
source: html/b1c8b64e-72d4-f0c8-4345-6f3f80972a3f.htm
---
# Autodesk.Revit.DB.FaceArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.